habworks/Arb_Power_Booster/Firmware/ArbPwrBooster_App/STM32CubeIDE/Application/User/App_Support/Src/ADC_Support.c
// RMS STUFF
// TODO: Hab make a single RMS function
// Circular buffer for storing recent ADC values
static float BufferWindow_CH1[RMS_WINDOW_SIZE] = {0};
// Function to update RMS in real-time
double update_CH1_RMS_Current(double NewSampleValue)
{
    static int Index = 0;
    static int Count = 0;
    static double SumOfSquares = 0.0;

    double RMS_CurrentValue;
    // Remove the oldest value from sum_squares if buffer is full
    if (Count >= RMS_WINDOW_SIZE)
        SumOfSquares -= BufferWindow_CH1[Index] * BufferWindow_CH1[Index];  // Remove old squared value
    else
        Count++;

    // Store new value and update sum of squares
    BufferWindow_CH1[Index] = NewSampleValue;
    SumOfSquares += NewSampleValue * NewSampleValue;

    // Update RMS
    RMS_CurrentValue = sqrt(SumOfSquares / Count);

    // Move buffer index (circular)
    Index = (Index + 1) % RMS_WINDOW_SIZE;

    return(RMS_CurrentValue);
}


static float BufferWindow_CH2[RMS_WINDOW_SIZE] = {0};
double update_CH2_RMS_Current(double NewSampleValue)
{
    static int Index = 0;
    static int Count = 0;
    static double SumOfSquares = 0.0;

    double RMS_CurrentValue;
    // Remove the oldest value from sum_squares if buffer is full
    if (Count >= RMS_WINDOW_SIZE)
        SumOfSquares -= BufferWindow_CH2[Index] * BufferWindow_CH2[Index];  // Remove old squared value
    else
        Count++;

    // Store new value and update sum of squares
    BufferWindow_CH2[Index] = NewSampleValue;
    SumOfSquares += NewSampleValue * NewSampleValue;

    // Update RMS
    RMS_CurrentValue = sqrt(SumOfSquares / Count);

    // Move buffer index (circular)
    Index = (Index + 1) % RMS_WINDOW_SIZE;

    return(RMS_CurrentValue);
}


static float BufferWindowVoltage_CH1[RMS_WINDOW_SIZE] = {0};
double update_CH1_RMS_Voltage(double NewSampleValue)
{
    static int Index = 0;
    static int Count = 0;
    static double SumOfSquares = 0.0;

    double RMS_CurrentValue;
    // Remove the oldest value from sum_squares if buffer is full
    if (Count >= RMS_WINDOW_SIZE)
        SumOfSquares -= BufferWindowVoltage_CH1[Index] * BufferWindowVoltage_CH1[Index];  // Remove old squared value
    else
        Count++;

    // Store new value and update sum of squares
    BufferWindowVoltage_CH1[Index] = NewSampleValue;
    SumOfSquares += NewSampleValue * NewSampleValue;

    // Update RMS
    RMS_CurrentValue = sqrt(SumOfSquares / Count);

    // Move buffer index (circular)
    Index = (Index + 1) % RMS_WINDOW_SIZE;

    return(RMS_CurrentValue);
}


static float BufferWindowVoltage_CH2[RMS_WINDOW_SIZE] = {0};
double update_CH2_RMS_Voltage(double NewSampleValue)
{
    static int Index = 0;
    static int Count = 0;
    static double SumOfSquares = 0.0;

    double RMS_CurrentValue;
    // Remove the oldest value from sum_squares if buffer is full
    if (Count >= RMS_WINDOW_SIZE)
        SumOfSquares -= BufferWindowVoltage_CH2[Index] * BufferWindowVoltage_CH2[Index];  // Remove old squared value
    else
        Count++;

    // Store new value and update sum of squares
    BufferWindowVoltage_CH2[Index] = NewSampleValue;
    SumOfSquares += NewSampleValue * NewSampleValue;

    // Update RMS
    RMS_CurrentValue = sqrt(SumOfSquares / Count);

    // Move buffer index (circular)
    Index = (Index + 1) % RMS_WINDOW_SIZE;

    return(RMS_CurrentValue);
}
